---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewDiscipline
source: html/c44b0c36-44be-ef1c-9440-365ab79316c1.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewDiscipline Property

"Discipline"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewDiscipline { get; }
```